In [1]:
pip install --upgrade sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-1.4.26-cp39-cp39-win_amd64.whl (1.5 MB)
Collecting greenlet!=0.4.17
  Downloading greenlet-1.1.2-cp39-cp39-win_amd64.whl (101 kB)
Installing collected packages: greenlet, sqlalchemy
Successfully installed greenlet-1.1.2 sqlalchemy-1.4.26
Note: you may need to restart the kernel to use updated packages.

In [15]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
from pandas import DataFrame
from matplotlib import pyplot
import urllib

In [16]:
HOSTNAME = "localhost"
PORT = 3306
USERNAME = "root"
PASSWORD = "123qwe!@#"
DATABASE = "myschool"
CHARSET1 = "utf8"
CHARSET2 = "utf-8"

# 데이터베이스 접속하기

In [18]:
con_str_fmt = "mysql+mysqldb://{0}:{1}@{2}:{3}/{4}?charset={5}"

con_str = con_str_fmt.format(USERNAME, urllib.parse.quote(PASSWORD),
                             HOSTNAME, PORT, DATABASE, CHARSET1)
con_str

'mysql+mysqldb://root:123qwe%21%40%23@localhost:3306/myschool?charset=utf8'

In [19]:
pymysql.install_as_MySQLdb()
import MySQLdb

In [20]:
engine = create_engine(con_str, encoding = CHARSET2)
conn = engine.connect()

# 데이터 저장하기

In [21]:
df1 = DataFrame([
        {"deptno": 300, "dname": "학과1", "loc": "위치1"},
        {"deptno": 301, "dname": "학과2", "loc": "위치2"},
        {"deptno": 302, "dname": "학과3", "loc": "위치3"}
])
df1

   deptno dname  loc
0     300   학과1  위치1
1     301   학과2  위치2
2     302   학과3  위치3

In [22]:
df1.to_sql(name = "department_py", con = conn, if_exists='replace', index = True)
#결과확인 sql에서

In [23]:
df1.to_sql(name = "department_py", con = conn, if_exists='replace', index = False)

In [24]:
df2 = DataFrame([
        {"deptno": 300, "dname": "학과1", "loc": "위치1"},
        {"deptno": 301, "dname": "학과2", "loc": "위치2"},
        {"deptno": 302, "dname": "학과3", "loc": "위치3"}
])
df2.set_index('deptno', inplace=True)
df2

       dname  loc
deptno
300      학과1  위치1
301      학과2  위치2
302      학과3  위치3

In [25]:
df2.to_sql(name = "department_py", con=conn, if_exists='replace', index=True)

# 데이터 조회하기

In [26]:
sql = "SELECT deptno, dname, loc FROM department_py WHERE deptno = 300"
df3 = pd.read_sql(sql, index_col='deptno', con=conn)
df3

       dname  loc
deptno
300      학과1  위치1

In [27]:
df4 = pd.read_sql_table("department_py", index_col = 'deptno', con=conn)
df4

       dname  loc
deptno
300      학과1  위치1
301      학과2  위치2
302      학과3  위치3

In [28]:
df5 = pd.read_sql_table("department_py",
                       index_col='deptno',
                       columns=['dname'],
                       con = conn)
df5

       dname
deptno
300      학과1
301      학과2
302      학과3

In [29]:
conn.close()